<?
    /* ============================================================================== */
    /* =   PAGE : 공통 통보 PAGE                                                    = */
    /* = -------------------------------------------------------------------------- = */
    /* =   오류 발생시 아래의 주소에서 조회하시기 바랍니다.                         = */
    /* =   http://testpay.kcp.co.kr/pgsample/FAQ/search_error.jsp                   = */
    /* = -------------------------------------------------------------------------- = */
    /* =   Copyright (c)  2006   KCP Inc.   All Rights Reserverd.                   = */
    /* ============================================================================== */
?>
<?

    $access_ip	= $_SERVER['REMOTE_ADDR'];
	$ip_arr = array('203.238.36.58','203.238.36.161','203.238.36.178','203.238.36.160','203.238.36.173');
	if(!in_array($access_ip,$ip_arr)) exit;

	$lib_path = "../../lib";
	$inc_path = "../../include";

	require "{$lib_path}/lib.Function.php";
	include "{$inc_path}/dbconn.php";
	require "{$lib_path}/class.Mysql.php";
	$mysql = new mysqlClass();

	$sql = "SELECT code FROM mall_design WHERE mode='B'";
	$tmp_cash = $mysql->get_one($sql);
	$cash = explode("|*|",stripslashes($tmp_cash));

	$SHOP_ID = trim($cash[3]);
     
    /* ============================================================================== */
    /* =   01. 공통 통보 페이지 설명(필독!!)                                        = */
    /* = -------------------------------------------------------------------------- = */
    /* =   공통 통보 페이지에서는, 가상계좌 입금 통보 데이터와 모바일안심결제       = */
    /* =   통보 데이터 등을 KCP 를 통해 별도로 통보 받을 수 있습니다. 이러한 통보   = */
    /* =   데이터를 받기 위해 가맹점측은 결과를 전송받는 페이지를 마련해 놓아야     = */
    /* =   합니다. 현재의 페이지를 업체에 맞게 수정하신 후, KCP 관리자 페이지에     = */
    /* =   등록해 주시기 바랍니다. 등록 방법은 연동 매뉴얼을 참고하시기 바랍니다.   = */
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   02. 공통 통보 데이터 받기                                                = */
    /* = -------------------------------------------------------------------------- = */
    $site_cd      = $_POST [ "site_cd"  ];                 // 사이트 코드
    $tno          = $_POST [ "tno"      ];                 // KCP 거래번호
    $order_no     = $_POST [ "order_no" ];                 // 주문번호
    $tx_cd        = $_POST [ "tx_cd"    ];                 // 업무처리 구분 코드
    $tx_tm        = $_POST [ "tx_tm"    ];                 // 업무처리 완료 시간
    /* = -------------------------------------------------------------------------- = */
    $ipgm_name    = "";                                    // 주문자명
    $remitter     = "";                                    // 입금자명
    $ipgm_mnyx    = "";                                    // 입금 금액
    $bank_code    = "";                                    // 은행코드
    $account      = "";                                    // 가상계좌 입금계좌번호
    $op_cd        = "";                                    // 처리구분 코드
    $noti_id      = "";                                    // 통보 아이디
    /* = -------------------------------------------------------------------------- = */

    /* = -------------------------------------------------------------------------- = */
    /* =   02-1. 가상계좌 입금 통보 데이터 받기                                     = */
    /* = -------------------------------------------------------------------------- = */
    if ( $tx_cd == "TX00" )
    {
        $ipgm_name = $_POST[ "ipgm_name" ];                // 주문자명
        $remitter  = $_POST[ "remitter"  ];                // 입금자명
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
        $account   = $_POST[ "account"   ];                // 가상계좌 입금계좌번호
        $op_cd     = $_POST[ "op_cd"     ];                // 처리구분 코드
        $noti_id   = $_POST[ "noti_id"   ];                // 통보 아이디
        $cash_a_no = $_POST[ "cash_a_no" ];                // 현금영수증 승인번호
    }

    /* = -------------------------------------------------------------------------- = */
    /* =   02-2. 모바일안심결제 통보 데이터 받기                                    = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX08" )
    {
        $ipgm_mnyx = $_POST[ "ipgm_mnyx" ];                // 입금 금액
        $bank_code = $_POST[ "bank_code" ];                // 은행코드
    }
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   03. 공통 통보 결과를 업체 자체적으로 DB 처리 작업하시는 부분입니다.      = */
    /* = -------------------------------------------------------------------------- = */
    /* =   통보 결과를 DB 작업 하는 과정에서 정상적으로 통보된 건에 대해 DB 작업을  = */
    /* =   실패하여 DB update 가 완료되지 않은 경우, 결과를 재통보 받을 수 있는     = */
    /* =   프로세스가 구성되어 있습니다. 소스에서 result 라는 Form 값을 생성 하신   = */
    /* =   후, DB 작업이 성공 한 경우, result 의 값을 "0000" 로 세팅해 주시고,      = */
    /* =   DB 작업이 실패 한 경우, result 의 값을 "0000" 이외의 값으로 세팅해 주시  = */
    /* =   기 바랍니다. result 값이 "0000" 이 아닌 경우에는 재통보를 받게 됩니다.   = */
    /* = -------------------------------------------------------------------------- = */

    /* = -------------------------------------------------------------------------- = */
    /* =   03-1. 가상계좌 입금 통보 데이터 DB 처리 작업 부분                        = */
    /* = -------------------------------------------------------------------------- = */
    if ( $tx_cd == "TX00" )
    {
		if($SHOP_ID!=$site_cd) exit;
		
		$sql = "SELECT * FROM mall_order_info WHERE pay_number='{$tno}' && pay_type='V' && order_num='{$order_no}'";
		$row = $mysql->one_row($sql);		

		if($row) {
			$bSucc = "0000";

			if($op_cd!='13') {
				$card_info = $row['pay_info'].", 입금자명 : {$remitter}, 입금금액 : {$ipgm_mnyx}, 통보아이디 : {$noti_id}";		
				if($cash_a_no) $card_info .= ", 현금영수증 승인번호 : {$cash_a_no}";

				$sql = "UPDATE mall_order_info SET pay_status='B' , pay_info='{$card_info}', order_status='B' WHERE order_num = '{$order_no}'";
				mysql_query($sql,$mysql->con) or $bSucc = "false";				
						
				$signdate = date("Y-m-d H:i:s",time());
				$sql = "UPDATE mall_order_goods SET  order_status = 'B', status_date = '{$signdate}' WHERE order_num='{$order_no}'";
				mysql_query($sql,$mysql->con) or $bSucc = "false";		
			}
			else {
				if(eregi($noti_id,$row['pay_info'])){
					$card_info = $row['pay_info']." 입금취소 [입금자명 : {$remitter}, 입금금액 : {$ipgm_mnyx}, 통보아이디 : {$noti_id}]";		

					$sql = "UPDATE mall_order_info SET pay_status='C' , pay_info='{$card_info}', order_status='A' WHERE order_num = '{$order_no}'";
					mysql_query($sql,$mysql->con) or $bSucc = "false";				
						
					$signdate = date("Y-m-d H:i:s",time());
					$sql = "UPDATE mall_order_goods SET  order_status = 'A', status_date = '{$signdate}' WHERE order_num='{$order_no}'";
					mysql_query($sql,$mysql->con) or $bSucc = "false";		
				}				
			}
		}
		else $bSucc = "false";
	}

    /* = -------------------------------------------------------------------------- = */
    /* =   03-2. 모바일안심결제 통보 데이터 DB 처리 작업 부분                       = */
    /* = -------------------------------------------------------------------------- = */
    else if ( $tx_cd == "TX08" )
    {
    }
    /* ============================================================================== */


    /* ============================================================================== */
    /* =   04. result 값 세팅 하기                                                  = */
    /* ============================================================================== */
?>
<html><body><form><input type="hidden" name="result" value="<?=$bSucc?>"></form></body></html>